<template>
  <div class="tile is-ancestor is-vertical">
    <Test :test="createdTests[i]" v-for="(test,i) in createdTests" :key="i" />
  </div>
</template>
<script>
import Test from "./Test.vue";

export default {
  components: { Test },
  data() {
    return {
      showDetailsIndex: null,
      createdTests: [
        {
          id: "1",
          name: "Математика",
          category: "Рівняння",
          class: 5,
          count: 10,
          qest: [
            ["Скільки років Івану?", ["15", "14", "20", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "20", "20", "12"]]
          ]
        },
        {
          name: "Математика",
          category: "Рівняння",
          class: 5,
          count: 10,
          qest: [
            ["Скільки років Івану?", ["15", "14", "20", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "20", "20", "12"]]
          ]
        },
        {
          name: "Математика",
          category: "Рівняння",
          class: 5,
          count: 10,
          qest: [
            ["Скільки років Івану?", ["15", "14", "20", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "20", "20", "12"]]
          ]
        },
        {
          name: "Математика",
          category: "Рівняння",
          class: 5,
          count: 10,
          qest: [
            ["Скільки років Івану?", ["15", "14", "20", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "12"]],
            ["Скільки років Івану?", ["15", "14", "20", "20", "20", "12"]]
          ]
        }
      ]
    };
  },
  methods: {
    showDetails(index) {
      if (this.showDetailsIndex == index) return true;
      else return false;
    }
  },
  computed: {}
};
</script>
<style scoped>
.is-ancestor {
  margin: 1% !important;
}
</style>
